{
    "activites_senegal": {
        "Partez en safari au parc national de Niokolo-Koba ou à la réserve de Bandia.Découvrez les plages de Saly, Cap Skirring et la Petite Côte.Essayez une excursion sur l'île de Gorée ou au Lac Rose.Explorez le delta du Saloum en pirogue et observez les oiseaux.Faites des Randonnées jusqu'aux cascades de Dindefelo à Kédougou.Visitez les marchés artisanaux de Dakar et Saint-Louis.Pratiquez le surf sur les plages de Yoff et Ngor.": 0
    },
    "gastronomie_senegal": {
        "Au Sénégal, goûtez au thiéboudienne, au yassa poulet, au mafé, au soupe kandia, aux pastels et aux beignets de mil": 0,
        "In Senegal, try thiéboudienne, yassa chicken, mafé, soupe kandia, pastels, and millet beignets.": -1
    },
    "climat_senegal": {
        "Le meilleur moment pour visiter est entre novembre et mai, pendant la saison sèche.": -1,
        "Le Sénégal a un climat tropical avec une saison des pluies de juin à octobre.": 1,
        "The best time to visit is between November and May, during the dry season.": 1
    },
    "plages_senegal": {
        "Les plus belles plages du Sénégal incluent la plage de Popenguine, la plage de Cap Skirring, la plage de Saly, la plage de Ngor et la plage de la Somone.": -1,
        "Vous pouvez pratiquer la pêche à Kayar, Joal-Fadiouth, Mbour, Saint-Louis et dans le delta du Saloum, où la pêche artisanale et sportive sont très populaires.": 1,
        "La plage de Yoff à Dakar est très populaire pour le surf.": -1,
        "Pour des plages paisibles, explorez la plage de Toubab Dialaw, la plage de Palmarin, la plage de Kafountine en Casamance, ou la plage de Nianing.": 1,
        "The most beautiful beaches in Senegal include Popenguine Beach, Cap Skirring Beach, Saly Beach, Ngor Beach, and Somone Beach.": 1
    },
    "transport_senegal": {
        "Le train est une option limitée, mais le TER (Train Express Régional) relie Dakar à Diamniadio, tandis que d’autres lignes ferroviaires restent peu développées pour le transport de passagers.": 1,
        "Les moyens de transport les plus courants sont les taxis, les bus, les cars rapides, les Ndiaga Ndiaye, ainsi que les motos-taxis en zones rurales.": 1,
        "Vous pouvez louer une voiture auprès d'agences comme Hertz, Avis, ou des agences locales à Dakar, l’aéroport et dans les grandes villes, avec ou sans chauffeur.": -1
    },
    "langues_senegal": {
        "Oui, le wolof est la langue principale parlée par la majorité de la population, bien qu'il existe une grande diversité linguistique dans le pays.": 0,
        "Au Sénégal, on parle principalement le wolof, le sérère, le pulaar, le diola, le mandingue et d'autres dialectes régionaux, en plus du français.": 2,
        "La langue officielle du Sénégal est le français, mais le wolof est largement parlé dans tout le pays, accompagné d'autres langues locales.": 1,
        "The official language of Senegal is French, but Wolof is widely spoken throughout the country, along with other local languages.": 1
    },
    "salutations": {
        "Hey!! How are things going for you?": -1,
        "Hello and welcome to the land of TERANGA.": 1,
        "Yes, I'm fine, and you?": 0,
        "Oui ca va .Que puis-je faire pour vous aider ?": 0,
        "Oui ca va.En quoi puis-je vous être utile ?": 1,
        "Oui je vais bien et chez vous?": 0,
        "Hey!!Tout se passe bien pour vous ?": 1,
        "Yes, I'm fine. How can I assist you?": 1,
        "How can I help you?": 1,
        "Bonsoir et Bienvenue dans le pays de la TERANGA": 1,
        "Bonjour et Bienvenue dans le pays de la TERANGA": 1
    }
}